In [2]:
import pandas as pd
from sqlalchemy import create_engine, text

# Replace 'username', 'password', 'localhost', and 'database_name' with your MySQL credentials and database name.
connection_string = 'mysql+pymysql://vikram:123@localhost/hr_emp'
engine = create_engine(connection_string)

In [3]:
# Use the engine to read the SQL query into a pandas DataFrame.
SQL_Query = pd.read_sql_query('SELECT * FROM employees', engine)

# Now you can work with the DataFrame containing the query results.
SQL_Query.head()

,employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,commission_pct,manager_id,department_id
0,1,Aman,Sharma,ASHARMA,715.234.4577,1977-06-16,AD_VP,34000.0,NaN,1,NaN
1,2,Gopi,Kumar,GKUMAR,715.134.8765,1979-09-27,AD_PRES,29000.0,NaN,2,50.0
2,3,Laxman,Dubey,LDUBEY,915.173.8969,1983-01-23,AD_VP,28000.0,NaN,1,50.0
3,4,Abhishek,Sharma,ASHARMA,901.765.7869,1996-01-30,FI_MGR,15000.0,NaN,3,70.0
4,5,Bhuvan,Bhosle,BBHOSLE,999.673.9878,1982-05-01,FI_MGR,13000.0,NaN,3,70.0

In [1]:
from sqlalchemy import create_engine, text

connection_string = 'mysql+pymysql://vikram:123@localhost/hr_emp'
engine = create_engine(connection_string)

connection = engine.connect()

stmt = text("select * from employees where employee_id=:emp_id;")

# Use a dictionary with the correct key for the parameter, which is 'emp_id', not 'emp_id:2'.
result = connection.execute(stmt, {"emp_id": 2})
row = result.first()

In [2]:

print(row)
print(row[1])
print(row.last_name)
print(row._mapping["phone_number"])

(2, 'Gopi', 'Kumar', 'GKUMAR', '715.134.8765', datetime.date(1979, 9, 27), 'AD_PRES', Decimal('29000.00'), None, 2, 50)
Gopi
Kumar
715.134.8765

In [3]:
row._mapping.keys()

RMKeyView(['employee_id', 'first_name', 'last_name', 'email', 'phone_number', 'hire_date', 'job_id', 'salary', 'commission_pct', 'manager_id', 'department_id'])

In [4]:
row._mapping.values()

ROMappingKeysValuesView({'employee_id': 2, 'first_name': 'Gopi', 'last_name': 'Kumar', 'email': 'GKUMAR', 'phone_number': '715.134.8765', 'hire_date': datetime.date(1979, 9, 27), 'job_id': 'AD_PRES', 'salary': Decimal('29000.00'), 'commission_pct': None, 'manager_id': 2, 'department_id': 50})

In [5]:
result = connection.execute(text("select * from employees where employee_id <5"))
for emp in result:
    print(emp[0],"|",emp[1],"|",emp[2])

1 | Aman | Sharma
2 | Gopi | Kumar
3 | Laxman | Dubey
4 | Abhishek | Sharma

In [6]:
connection.close()

In [9]:
with engine.connect() as connection:
    rows = connection.execute(text("select * from employees where employee_id <5"))

    for emp in rows:
        print(emp[0],"|",emp[1],"|",emp[2])

1 | Aman | Sharma
2 | Gopi | Kumar
3 | Laxman | Dubey
4 | Abhishek | Sharma

In [ ]:
from sqlalchemy import create_engine, MetaData, Table, Column, Integer, String, select
# engine = create_engine('sqlite:///college.db', echo = True)
metadata = MetaData()

user_table = Table(
   'user_account', metadata, 
   Column('id', Integer, primary_key = True), 
   Column('username', String(50), nullable=False), 
   Column('fullname', String(50)), 
)

In [ ]:
user_table.name

In [ ]:
user_table.c.username

In [ ]:
user_table.c.id

In [ ]:
user_table.c.fullname

In [ ]:
print(select(user_table))

In [ ]:
engine =create_engine("sqlite://")

with engine.begin() as conn:
    metadata.create_all(conn)